{"extracted_information": "HyperEVM is a component of Hyperliquid's dual-network system, working alongside HyperCore. It functions similar to other EVM networks but features a Dual Block Size architecture and utilizes read precompiles for accessing HyperCore state. It supports standard ERC20 token deployment and development tooling.", "specifications": {"architecture_type": "EVM compatible, Dual Network System (with HyperCore)", "block_architecture": "Dual Block Size", "small_block_details": {"gas_limit": "2M gas", "production_frequency": "Every 1 second", "primary_use": "Handle typical user transactions"}, "large_block_details": {"gas_limit": "30M gas", "production_frequency": "Every 1 minute", "primary_use": "Complex operations such as contract deployments"}, "interaction_methods": "Standard RPC Methods (for HyperEVM), Read Precompiles (for HyperCore state access)", "token_type_supported": "ERC20 tokens"}, "pricing": {}, "features": [{"name": "Dual Block Architecture", "description": "Allows for different block sizes and frequencies to optimize for transaction speed and complexity.", "details": ["Small blocks (2M gas, 1s interval) for fast transactions.", "Large blocks (30M gas, 1min interval) for complex operations like contract deployments."]}, {"name": "Read Precompiles", "description": "Special system-level addresses on HyperEVM that allow smart contracts to securely, gas-efficiently, and read-only access data from HyperCore.", "details": ["Bypass standard EVM execution, triggering native code execution on validator nodes.", "Enables access to HyperCore data like order book balances, positions, and protocol-level metrics.", "Powers cross-chain bridging between ERC-20 tokens on HyperEVM and HIP-1 tokens on HyperCore."]}, {"name": "EVM Compatibility", "description": "Supports standard EVM development tooling and smart contract design patterns."}], "statistics": {}, "temporal_info": {"small_block_frequency": "1 second", "large_block_frequency": "1 minute"}, "geographical_data": {}, "references": []}