{"extracted_information": "HyperEVM transforms Hyperliquid into a fully programmable financial system by integrating smart contract capabilities directly with Hyperliquid's high-performance order books, combining the efficiency of centralized exchange order books with the programmability of smart contracts. It enables developers to build applications directly tapping into deep, high-performance liquidity without sacrificing decentralization or requiring complex bridging solutions. HyperEVM operates based on the Cancun EVM specification (without blob) and has EIP-1559 enabled, with both base fees and priority fees burned due to HyperBFT consensus.", "specifications": {"EVM_specification": "Cancun EVM (without blob)", "EIP_support": "EIP-1559 enabled (base fees and priority fees burned)", "consensus_mechanism": "HyperBFT consensus", "architecture_note": "Dual-Block Architecture (mentioned, details not provided in snippet)"}, "pricing": {}, "features": [{"name": "Full Programmability", "description": "Transforms Hyperliquid into a fully programmable financial system."}, {"name": "Integrated Smart Contracts", "description": "Integrates smart contract capabilities directly with Hyperliquid's high-performance order books."}, {"name": "DeFi Paradigm Shift", "description": "Combines efficiency of centralized exchange order books with programmability of smart contracts."}, {"name": "Direct Liquidity Access", "description": "Allows applications to directly tap into deep, high-performance liquidity."}, {"name": "Decentralization & Bridging", "description": "Achieves decentralization without requiring complex bridging solutions."}, {"name": "Ethereum Tool Compatibility", "description": "Ensures compatibility with existing Ethereum tools and development practices due to Cancun EVM specification."}], "statistics": {}, "temporal_info": {}, "geographical_data": {}, "references": [], "relationship_with_hypercore": {"transfers": "HyperCore <> HyperEVM transfers", "mechanism": "Eliminates complexities of traditional cross-chain solutions (wrapped tokens, trusted validators, lengthy verification periods) because both environments share the same underlying consensus.", "asset_behavior": "Assets maintain their identity and properties regardless of which environment they're used in, creating a seamless experience.", "interaction_note": "Interacting with HyperCore (mentioned, details not provided in snippet)"}}