{"extracted_information": "Detailed technical information about Hyperliquid's HyperEVM, HyperCore architecture, cross-layer operations, CoreWriter mechanism, and integration patterns.", "specifications": {"HyperCore_Architecture": {"description": "Hyperliquid’s original perpetual decentralized exchange, functioning as the foundational liquidity layer.", "consensus_mechanism": "HyperBFT (optimized Byzantine Fault Tolerant algorithm)", "performance": {"orders_per_second": "hundreds of thousands", "block_finalization_time": "under one second", "daily_trading_volume": "up to $30 billion"}, "structure": "Operates as its own Layer-1 blockchain, providing complete control over block space.", "features": ["Reduced trading fees for HYPE stakers", "Built-in MEV protections at the consensus layer"]}, "HyperEVM": {"description": "Hyperliquid’s permissionless innovation layer, providing an EVM-compatible environment for smart contract deployment.", "compatibility": "Fully EVM-compatible", "access": "Maintains direct access to HyperCore’s deep Central Limit Order Book (CLOB).", "design_philosophy": "Open development model, mirroring an unrestricted app ecosystem (Android-style openness).", "key_innovation": "Unified state design, eliminating the need for bridges or cross-chain complexity.", "composability": "Applications can read and write directly to HyperCore’s orderbooks in real-time.", "developer_ecosystem": "Inherits web3’s mature developer ecosystem, tooling, libraries, and expertise.", "purpose": "Platform’s experimentation layer for prototyping novel use cases and complementary services."}, "CoreWriter_Mechanism": {"description": "The essential connector enabling HyperEVM applications to directly interact with HyperCore's native systems.", "function": "Allows HyperEVM applications to write directly to HyperCore, eliminating trusted intermediaries.", "impact": "Transforms HyperEVM into a chain that natively inherits access to Hyperliquid's performance, liquidity, and onchain order book.", "interaction_type": "Enables bidirectional interaction between Hyperliquid’s two execution layers (HyperEVM and HyperCore).", "capabilities": "Smart contracts can seamlessly execute native operations (staking, trading, liquidity provision) on HyperCore, treating them as first-class operations rather than external dependencies.", "system_contract_address": "0x3333333333333333333333333333333333333333 (used by Kinetiq)", "launch_date": "July 5th"}, "Cross_Layer_Operations": {"description": "The synergistic interaction between the permissioned HyperCore and the permissionless HyperEVM.", "paradigm": "Dual-layer design connecting HyperCore with DeFi innovation via CoreWriter.", "enables": ["Financial engineering like tokenizing perpetual positions", "Creating native delta-neutral strategies", "Flash-loaning liquidity"], "staking_interoperability": "Liquid staking protocols leverage CoreWriter to bridge multi-faceted staking primitives between HyperCore's native execution layer and HyperEVM's smart contract environment, enabling Hyperliquid-native restaking.", "data_flow": "HyperEVM applications can read and write directly to HyperCore’s deep orderbooks in real-time."}}, "features": [{"name": "Builder Codes", "category": "Integration Pattern", "description": "Unique identifiers allowing any developer to connect their frontend to Hyperliquid’s backend and earn revenue.", "mechanism": "Every trade executed through a Builder Code is routed via Hyperliquid's order book, automatically paying a percentage of trading fees to the developer.", "customization": "Full customization, particularly regarding fees, allowing builders to apply margins.", "vision": "Part of Hyperliquid's 'AWS of liquidity' strategy by outsourcing product distribution."}, {"name": "HIP-3 (Builder-Deployed Perpetuals)", "category": "Integration Pattern", "description": "Enables permissionless market creation on HyperCore.", "mechanism": "Dutch auction system running every 31 hours for market deployment rights.", "requirements": "Requires staking 1 million HYPE tokens as security collateral.", "control": "Winner gains full control over key market parameters: oracle selection, margin requirements, funding mechanisms.", "revenue_sharing": "Market creators can earn up to 50% of trading fees from their market.", "scope": "Opens door for permissionless access to various market types: equities, commodities, FX, prediction markets, etc."}, {"name": "HYPE Liquid Staking (LSTs)", "category": "Integration Pattern", "description": "Transforms HYPE staking from simple consensus delegation into active economic infrastructure and capital allocators.", "architecture": "Leverages CoreWriter and Hyperliquid's dual-block architecture for non-custodial execution.", "functionality": "Bridge staking primitives between HyperCore and HyperEVM, enabling underlying staked HYPE to be leveraged for new perpetual markets via HIP-3 (Hyperliquid-native restaking).", "providers": [{"name": "Kinetiq", "products": ["kHYPE", "iHYPE", "vkHYPE"], "features": "Pioneers trustless cross-layer operations via CoreWriter precompiles (interface with 0x333... system contract), enabling autonomous validator delegations and reward distributions from smart contracts. Largest LST (78% market share, $1.28 billion TVL)."}, {"name": "StakedHYPE (stHYPE)", "features": "Retail-accessible, offers instant unstaking (liquidity permitting), seamless rebase mechanics, 1:1 HYPE backing, and integration across Hyperliquid DeFi (HyperSwap, Felix Protocol). (11% market share, $181 million TVL)."}, {"name": "Hyperbeat (beHYPE)", "features": "CoreWriter and HIP-3 powered LST, collaboration with Ether.fi. (7% market share, $114 million TVL pre-deposit)."}, {"name": "Looped HYPE (LHYPE)", "features": "Targets yield farmers with automated leveraged looping strategies (up to 15x leverage), 10% APY. Charges 10% performance fees. (3.3% market share, $54 million TVL)."}, {"name": "Hyperpie (mHYPE)", "features": "Integrated ecosystem with liquid staking, MEME token launchpad, ve(3,3) governance tokenomics. (0.5% market share, $9 million TVL)."}]}, {"name": "HyperUnit", "category": "Integration Pattern", "description": "Tokenization protocol for secure asset transfers from other blockchains into HyperCore and HyperEVM.", "mechanism": "Distributed network of three Guardians using Multi-Party Computation (MPC) to split private keys, ensuring no single entity control.", "benefit": "Allows users to trade real Bitcoin and Ethereum directly on Hyperliquid, eliminating reliance on wrapped tokens or external bridges, creating a unified financial environment."}, {"name": "RPC Infrastructure (HypeRPC)", "category": "Integration Pattern", "description": "Dedicated RPC provider making Hyperliquid EVM accessible.", "performance": "Ultra-low latency and 99.99% uptime.", "node_types": ["RPC EVM Full Node: Stores recent blockchain state and limited historical data.", "RPC EVM Archive Node: Contains entire blockchain history from genesis.", "L1 Data Node: Serves low-latency, chain-level data for Hyperliquid Layer 1.", "API Node: Handles subset of API requests directly from local node state, avoiding public API rate limits."]}, {"name": "Multi-tier Oracle Architecture", "category": "Integration Pattern", "description": "Addresses oracle needs across different operational environments (HyperCore and HyperEVM).", "components": [{"name": "Native HyperCore Oracle", "description": "Price feeds embedded directly into validator infrastructure, with the entire validator set participating in price discovery. Decentralized, but less scalable for new, complex markets."}, {"name": "Builder-Deployed Oracles (HIP-3)", "description": "Deployers of HIP-3 markets are responsible for oracle selection, requiring top-tier security and HyperCore integration expertise. Needs architectures flexible enough to deliver data in HyperCore's unique API format with sufficient decentralization and redundancy."}, {"name": "HyperEVM DeFi Oracles", "description": "Supports standard EVM oracle integrations. The CoreWriter functionality enables novel DeFi synergies bridging HyperEVM and HyperCore, leading to sophisticated cross-layer applications requiring bespoke oracle integrations."}]}]}