{"extracted_information": "Stripe provides a webhook architecture for applications to receive real-time event data as events occur in a Stripe account. This enables automated reactions to asynchronous events. The system uses HTTPS POST requests with JSON payloads containing Event objects. Event handling requires quick 2xx responses and asynchronous processing for scalability. Security features include signature verification, replay attack prevention, and IP address validation. Stripe implements automatic and manual retries for event delivery but does not guarantee event ordering. Event object structure is tied to the API version at the time of occurrence.", "specifications": {"webhook_endpoint_protocol": "HTTPS (HTTP for local development)", "webhook_endpoint_method": "POST", "webhook_payload_format": "JSON", "webhook_payload_content": "Stripe Event object", "max_webhook_endpoints_per_account": 16, "event_retry_live_mode": {"attempts": "Up to 3 days", "strategy": "Exponential back-off"}, "event_retry_sandbox_mode": {"attempts": "3 times over a few hours"}, "manual_retry_availability_dashboard": "Up to 15 days after event creation", "manual_retry_availability_cli": "Up to 30 days after event creation", "tls_version_support": "v1.2 or higher", "signature_timestamp_tolerance": "Default 5 minutes (configurable)", "event_api_versioning": "Determined by account settings at event occurrence, not retrospective"}, "pricing": {}, "features": [{"name": "Event Delivery Mechanism", "description": "Stripe pushes real-time event data to registered HTTPS webhook endpoints as JSON payloads."}, {"name": "Event Object", "description": "Each event is delivered as a JSON payload containing an Event object, which can be API v1 (snapshot) or API v2 (thin)."}, {"name": "Asynchronous Event Handling", "description": "Supports responding to events like payment confirmation, charge disputes, or recurring payment success."}, {"name": "Webhook Endpoint Handler", "description": "Requires an HTTP/HTTPS endpoint function that accepts POST requests, inspects the Event object, and quickly returns a 2xx status code."}, {"name": "Organization Event Destinations", "description": "Allows listening to events from accounts within an organization, with specific behaviors for certain event types (e.g., `issuing_authorization.request`, `checkout_sessions.completed`, `invoice.created`)."}, {"name": "Local Testing", "description": "Stripe CLI can forward events to a local webhook endpoint for development and testing."}, {"name": "Signature Verification", "description": "Verifies that webhook requests originate from Stripe using the `Stripe-Signature` header and an endpoint secret, preventing tampering and replay attacks (with timestamp check)."}, {"name": "Duplicate Event Handling", "description": "Recommendations to guard against duplicate event receipts by logging event IDs and checking `data.object` with `event.type`."}, {"name": "Configurable Event Types", "description": "Ability to configure webhook endpoints to receive only specific event types required by the integration, reducing server strain."}, {"name": "Asynchronous Processing Recommendation", "description": "Encourages processing incoming events with an asynchronous queue to handle spikes in deliveries and prevent timeouts."}, {"name": "Endpoint Security Management", "description": "Supports periodic rolling (changing) of endpoint signing secrets and advises trusting events only from Stripe's official IP addresses."}, {"name": "Debugging Tools", "description": "Dashboard provides 'Events' tab to view event deliveries (Delivered, Pending, Failed) and HTTP status codes for troubleshooting."}], "statistics": {}, "temporal_info": {"event_delivery_retries": "Up to 3 days for live mode, 3 times over a few hours for sandbox mode.", "manual_retry_window_dashboard": "15 days", "manual_retry_window_cli": "30 days", "signature_timestamp_validation": "Default 5 minutes tolerance between timestamp in signature and current time to prevent replay attacks."}, "geographical_data": {}, "references": ["Amazon EventBridge as an event destination", "Stripe CLI", "Stripe Dashboard (Webhooks tab)", "Stripe API (Event destinations, Webhook endpoints, Events)", "Stripe Shell", "Stripe for VS Code", "OWASP: Cross-Site Request Forgery (CSRF)", "TLS security guide", "NTP (Network Time Protocol)", "Stripe official libraries for signature verification"]}