{"extracted_information": "The provided content details Tenderly's Transaction Simulator for Ethereum & EVM Networks. This tool allows users to preview exact results of blockchain transactions without sending them on-chain, preventing failures, security risks, and unnecessary gas costs. It supports 90+ EVM chains. The key features include custom simulations with control over inputs, parameters, contract code, and states; simulation bundles for interdependent transactions; and asset transfer tracking. It provides human-readable insights for DeFi transactions, including expected asset and balance changes (ERC-20, ERC-721 with dollar values), transaction status, 100% accurate gas estimates, human-readable errors for potential failures, and detailed transaction execution data (emitted events, state changes, involved contracts). Simulations can be accessed via Tenderly Node RPC (e.g., `tenderly_simulateTransaction` method) or the Dashboard. \n\n**Crucially, this technology is explicitly designed for 'EVM Networks'. As Hyperliquid is an L1 blockchain built on the Cosmos SDK and is not an EVM chain, these specific transaction simulation, preview capabilities, gas estimation features, and APIs offered by Tenderly as described in this content would NOT apply to Hyperliquid.**", "specifications": {"supported_networks": "90+ EVM chains", "gas_estimation_accuracy": "100% accurate"}, "pricing": {}, "features": [{"name": "Custom simulations", "description": "Run custom simulations with full control over transaction inputs, parameters, contract code, and contract states."}, {"name": "Simulation bundles", "description": "Test chained, interdependent transactions that involve multiple steps to preview complex executions."}, {"name": "Asset transfers", "description": "Get a list of the expected asset transfers to ensure transactions execute with desired results."}, {"name": "Asset & balance changes", "description": "See expected asset and balance changes for ERC-20 and ERC-721 tokens with corresponding dollar values."}, {"name": "Transaction status", "description": "Ensure transactions execute successfully and with intended results before sending on-chain."}, {"name": "Gas estimates", "description": "Determine how much gas is needed for successful execution to prevent failures caused by out-of-gas errors. Advertised as 100% accurate."}, {"name": "Human-readable errors", "description": "Get warnings with clear, human-readable messages on the cause of potential transaction failure."}, {"name": "Transaction execution data", "description": "Analyze transaction execution, including emitted events, state changes, and involved contracts."}, {"name": "Shareable links", "description": "Share links to failed transaction simulations to quickly find a solution with a team."}], "statistics": {}, "temporal_info": {}, "geographical_data": {}, "references": [{"title": "Case study: Safe", "url": "https://blog.tenderly.co/case-studies/safe/"}, {"title": "Case study: Instadapp", "url": "https://blog.tenderly.co/case-studies/instadapp/"}, {"title": "Case study: Enso Finance", "url": "https://blog.tenderly.co/case-studies/enso/"}]}